mcheah/Marlin4MPMD/MPMD_3dPrinter/STM32F4xx_LerdgeX/stm32f4xx_lerdgex.h
#define LCD_D0_PIN                                 GPIO_PIN_14
#define LCD_D0_GPIO_PORT                           GPIOD
#define LCD_D0_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D0_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOD_CLK_DISABLE()
#define LCD_D1_PIN                                 GPIO_PIN_15
#define LCD_D1_GPIO_PORT                           GPIOD
#define LCD_D1_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D1_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOD_CLK_DISABLE()
#define LCD_D2_PIN                                 GPIO_PIN_0
#define LCD_D2_GPIO_PORT                           GPIOD
#define LCD_D2_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D2_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOD_CLK_DISABLE()
#define LCD_D3_PIN                                 GPIO_PIN_1
#define LCD_D3_GPIO_PORT                           GPIOD
#define LCD_D3_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D3_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOD_CLK_DISABLE()
#define LCD_D4_PIN                                 GPIO_PIN_7
#define LCD_D4_GPIO_PORT                           GPIOE
#define LCD_D4_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D4_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D5_PIN                                 GPIO_PIN_8
#define LCD_D5_GPIO_PORT                           GPIOE
#define LCD_D5_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D5_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D6_PIN                                 GPIO_PIN_9
#define LCD_D6_GPIO_PORT                           GPIOE
#define LCD_D6_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D6_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D7_PIN                                 GPIO_PIN_10
#define LCD_D7_GPIO_PORT                           GPIOE
#define LCD_D7_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D7_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D8_PIN                                 GPIO_PIN_11
#define LCD_D8_GPIO_PORT                           GPIOE
#define LCD_D8_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D8_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D9_PIN                                 GPIO_PIN_12
#define LCD_D9_GPIO_PORT                           GPIOE
#define LCD_D9_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D9_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D10_PIN                                GPIO_PIN_13
#define LCD_D10_GPIO_PORT                          GPIOE
#define LCD_D10_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D10_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D11_PIN                                GPIO_PIN_14
#define LCD_D11_GPIO_PORT                          GPIOE
#define LCD_D11_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D11_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D12_PIN                                GPIO_PIN_15
#define LCD_D12_GPIO_PORT                          GPIOE
#define LCD_D12_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_D12_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOE_CLK_DISABLE()
#define LCD_D13_PIN                                GPIO_PIN_8
#define LCD_D13_GPIO_PORT                          GPIOD
#define LCD_D13_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D13_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()
#define LCD_D14_PIN                                GPIO_PIN_9
#define LCD_D14_GPIO_PORT                          GPIOD
#define LCD_D14_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D14_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()
#define LCD_D15_PIN                                GPIO_PIN_10
#define LCD_D15_GPIO_PORT                          GPIOD
#define LCD_D15_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_D15_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_NOE_PIN                                GPIO_PIN_4
#define LCD_NOE_GPIO_PORT                          GPIOD
#define LCD_NOE_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_NOE_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_NWE_PIN                                GPIO_PIN_5
#define LCD_NWE_GPIO_PORT                          GPIOD
#define LCD_NWE_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_NWE_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_NE1_PIN                                GPIO_PIN_7
#define LCD_NE1_GPIO_PORT                          GPIOD
#define LCD_NE1_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_NE1_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_RS_PIN                                 GPIO_PIN_11
#define LCD_RS_GPIO_PORT                           GPIOD
#define LCD_RS_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_RS_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_FSMC_AF								   GPIO_AF12_FSMC
#define LCD_FSMC_D_PINS							 (    LCD_D0_PIN | LCD_D1_PIN | LCD_D2_PIN | LCD_D3_PIN | LCD_D13_PIN | LCD_D14_PIN  \
													| LCD_D15_PIN | LCD_NOE_PIN | LCD_NWE_PIN | LCD_NE1_PIN | LCD_RS_PIN )
#define LCD_FSMC_E_PINS							 (    LCD_D4_PIN | LCD_D5_PIN | LCD_D6_PIN | LCD_D7_PIN | LCD_D8_PIN | LCD_D9_PIN  \
													| LCD_D10_PIN | LCD_D11_PIN | LCD_D12_PIN )

#define LCD_TOUCHEN_PIN                            GPIO_PIN_6
#define LCD_TOUCHEN_GPIO_PORT                      GPIOB
#define LCD_TOUCHEN_GPIO_CLK_ENABLE()            __HAL_RCC_GPIOB_CLK_ENABLE()
#define LCD_TOUCHEN_GPIO_CLK_DISABLE()           __HAL_RCC_GPIOB_CLK_DISABLE()

#define LCD_BACKLIGHT_PIN                          GPIO_PIN_3
#define LCD_BACKLIGHT_GPIO_PORT                    GPIOD
#define LCD_BACKLIGHT_GPIO_CLK_ENABLE()          __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_BACKLIGHT_GPIO_CLK_DISABLE()         __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_RST_PIN                                GPIO_PIN_6
#define LCD_RST_GPIO_PORT                          GPIOD
#define LCD_RST_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_RST_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_BUZZ_PIN                               GPIO_PIN_12
#define LCD_BUZZ_GPIO_PORT                         GPIOD
#define LCD_BUZZ_GPIO_CLK_ENABLE()               __HAL_RCC_GPIOD_CLK_ENABLE()
#define LCD_BUZZ_GPIO_CLK_DISABLE()              __HAL_RCC_GPIOD_CLK_DISABLE()

#define LCD_BTN_PIN                                GPIO_PIN_2
#define LCD_BTN_GPIO_PORT                          GPIOE
#define LCD_BTN_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_BTN_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOE_CLK_DISABLE()

#define LCD_ENC1_PIN                               GPIO_PIN_3
#define LCD_ENC1_GPIO_PORT                         GPIOE
#define LCD_ENC1_GPIO_CLK_ENABLE()               __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_ENC1_GPIO_CLK_DISABLE()              __HAL_RCC_GPIOE_CLK_DISABLE()

#define LCD_ENC2_PIN                               GPIO_PIN_4
#define LCD_ENC2_GPIO_PORT                         GPIOE
#define LCD_ENC2_GPIO_CLK_ENABLE()               __HAL_RCC_GPIOE_CLK_ENABLE()
#define LCD_ENC2_GPIO_CLK_DISABLE()              __HAL_RCC_GPIOE_CLK_DISABLE()

/* Error code */
enum
{
  FLASHIF_OK = 0,
  FLASHIF_ERASEKO,
  FLASHIF_WRITINGCTRL_ERROR,
  FLASHIF_WRITING_ERROR,
  FLASHIF_PROTECTION_ERRROR
};
#define ADDR_FLASH_SECTOR_0     ((uint32_t)0x08000000) /* Base @ of Sector 0, 16 Kbyte */
#define ADDR_FLASH_SECTOR_1     ((uint32_t)0x08004000) /* Base @ of Sector 1, 16 Kbyte */
#define ADDR_FLASH_SECTOR_2     ((uint32_t)0x08008000) /* Base @ of Sector 2, 16 Kbyte */
#define ADDR_FLASH_SECTOR_3     ((uint32_t)0x0800C000) /* Base @ of Sector 3, 16 Kbyte */
#define ADDR_FLASH_SECTOR_4     ((uint32_t)0x08010000) /* Base @ of Sector 4, 64 Kbyte */
#define ADDR_FLASH_SECTOR_5     ((uint32_t)0x08020000) /* Base @ of Sector 5, 128 Kbyte */
#define ADDR_FLASH_SECTOR_6     ((uint32_t)0x08040000) /* Base @ of Sector 6, 128 Kbyte */
#define ADDR_FLASH_SECTOR_11     ((uint32_t)0x080E0000) /* Base @ of Sector 11, 128 Kbyte */
/*################################ ADCx for Nucleo 144 board ######################################*/
/**
  * @brief  ADCx Interface pins
  *         used to detect motion of Joystick available on Adafruit 1.8" TFT shield
  */
  
///* For some Nucleo144 boards, Arduino UNO pin7 (A3) is connected to PF3 in others to PC01 */
//#if defined(ADC3)
//#define NUCLEO_ADCx                          ADC3
//#define NUCLEO_ADCx_CLK_ENABLE()             __HAL_RCC_ADC3_CLK_ENABLE()
//#define NUCLEO_ADCx_CLK_DISABLE()            __HAL_RCC_ADC3_CLK_DISABLE()
//
//#define NUCLEO_ADCx_CHANNEL                  ADC_CHANNEL_9
//#define NUCLEO_ADCx_GPIO_PORT                GPIOF
//#define NUCLEO_ADCx_GPIO_PIN                 GPIO_PIN_3
//#define NUCLEO_ADCx_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOF_CLK_ENABLE()
//#define NUCLEO_ADCx_GPIO_CLK_DISABLE()       __HAL_RCC_GPIOF_CLK_DISABLE()
//
//#else
//#define NUCLEO_ADCx                          ADC1
//#define NUCLEO_ADCx_CLK_ENABLE()             __HAL_RCC_ADC1_CLK_ENABLE()
//#define NUCLEO_ADCx_CLK_DISABLE()            __HAL_RCC_ADC1_CLK_DISABLE()
//#define NUCLEO_ADCx_CHANNEL                  ADC_CHANNEL_11
//
//#define NUCLEO_ADCx_GPIO_PORT                GPIOC
//#define NUCLEO_ADCx_GPIO_PIN                 GPIO_PIN_1
//#define NUCLEO_ADCx_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOC_CLK_ENABLE()
//#define NUCLEO_ADCx_GPIO_CLK_DISABLE()       __HAL_RCC_GPIOC_CLK_DISABLE()
//#endif /* HAL_ADC_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup STM32F4XX_LERDGEX_LOW_LEVEL_Exported_Macros STM32F4XX NUCLEO 144 LOW LEVEL Exported Macros
  * @{
  */  
/**
  * @}
  */ 

/** @defgroup STM32F4XX_LERDGEX_LOW_LEVEL_Exported_Functions STM32F4XX NUCLEO 144 LOW LEVEL Exported Functions
  * @{
  */
uint32_t         BSP_GetVersion(void);  
void             BSP_LED_Init(Led_TypeDef Led);
void             BSP_LED_DeInit(Led_TypeDef Led);
void             BSP_LED_On(Led_TypeDef Led);
void             BSP_LED_Off(Led_TypeDef Led);
void             BSP_LED_Toggle(Led_TypeDef Led);
void             BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode);
void             BSP_PB_DeInit(Button_TypeDef Button);
uint32_t         BSP_PB_GetState(Button_TypeDef Button);
void			 BSP_LCD_Init();
void 			 FLASH_If_Init(void);
uint32_t 		 FLASH_If_Erase(uint32_t start,uint32_t end);
uint32_t 		 FLASH_If_Write(uint32_t destination, uint16_t *p_source, uint32_t length);

//#ifdef HAL_ADC_MODULE_ENABLED
//uint8_t          BSP_JOY_Init(void);
//JOYState_TypeDef BSP_JOY_GetState(void);
//void             BSP_JOY_DeInit(void);
//#endif /* HAL_ADC_MODULE_ENABLED */
static inline void delay_basic(float Sec)
{
	  uint32_t steps_per_sec = 48e6/450;
	  for(uint32_t i=0; i<Sec*steps_per_sec;i++)
	  {

	  }
}
  
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4XX_LERDGEX_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
